app/controllers/messages_controller.rb

  def index
    @messages = Message.order(id: :desc).page(params[:page]).per(5)
---
SELECT  `messages`.* FROM `messages` ORDER BY `messages`.`id` DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `messages`

  def create
    @message = Message.new(message_params)

    if @message.save
---
INSERT INTO `messages` (`content`, `created_at`, `updated_at`, `title`) VALUES ('きのこ', '2020-10-27 11:41:52', '2020-10-27 11:41:52', 'I am')

  def update
    # set_message
    # @message = Message.find(params[:id])

    if @message.update(message_params)
---
UPDATE `messages` SET `content` = 'きのこdesu', `updated_at` = '2020-10-28 13:07:12' WHERE `messages`.`id` = 102

  def destroy
    # set_message
    # @message = Message.find(parms[:id])
    @message.destroy
---
DELETE FROM `messages` WHERE `messages`.`id` = 103

  def set_message
    @message = Message.find(params[:id])
---
SELECT  `messages`.* FROM `messages` WHERE `messages`.`id` = 2 LIMIT 1